---
kind: other
id: Methods.T:Autodesk.Revit.DB.Transform2D
source: html/e16ae642-0bd4-1b7e-b40d-0c53c5fb19a8.htm
---
# Transform2D Methods

Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).